# Hands-on Lab 8: JOIN Operations

The practice problems for this Lab will provide hands on experience with the different kinds of join operations that we learned in this Module. We will be using the same HR Database that we used in the previous module.

## IMPORTANT: 
This lab assumes that you have already created and populated the tables in the sample HR database schema illustrated below in your instance of Db2 on IBM Cloud. If you have not done this yet, please complete the lab in the previous module before you start this one.

## Objectives
After completing this lab you will be able to:

 Use join operations on the Db2 database instance
Use SQL editor to run and check queries

In [1]:
%load_ext sql

In [2]:
# Remember the connection string is of the format:
# %sql ibm_db_sa://my-username:my-password@my-hostname:my-port/my-db-name
# Enter the connection string for your Db2 on Cloud database instance below
# i.e. copy after db2:// from the URI string in Service Credentials of your Db2 instance. Remove the double quotes at the end.
%sql ibm_db_sa://vcm60146:jfkx97p4v%2Bl255bk@dashdb-txn-sbox-yp-dal09-04.services.dal.bluemix.net:50000/BLUDB

DB2/LINUXX8664

## Sample HR DATABASE

In [3]:
%sql select * from employees limit 5;

 * ibm_db_sa://vcm60146:***@dashdb-txn-sbox-yp-dal09-04.services.dal.bluemix.net:50000/BLUDB
Done.

[('E1001    ', 'John', 'Thomas', '123456   ', datetime.date(1976, 1, 9), 'M', '5631 Rice, OakPark,IL', '100      ', Decimal('100000.00'), '30001    ', '2        '),
 ('E1002    ', 'Alice', 'James', '123457   ', datetime.date(1972, 7, 31), 'F', '980 Berry ln, Elgin,IL', '200      ', Decimal('80000.00'), '30002    ', '5        '),
 ('E1003    ', 'Steve', 'Wells', '123458   ', datetime.date(1980, 8, 10), 'M', '291 Springs, Gary,IL', '300      ', Decimal('50000.00'), '30002    ', '5        '),
 ('E1004    ', 'Santosh', 'Kumar', '123459   ', datetime.date(1985, 7, 20), 'M', '511 Aurora Av, Aurora,IL', '400      ', Decimal('60000.00'), '30004    ', '5        '),
 ('E1005    ', 'Ahmed', 'Hussain', '123410   ', datetime.date(1981, 1, 4), 'M', '216 Oak Tree, Geneva,IL', '500      ', Decimal('70000.00'), '30001    ', '2        ')]

In [6]:
%sql select * from job_history limit 5;

 * ibm_db_sa://vcm60146:***@dashdb-txn-sbox-yp-dal09-04.services.dal.bluemix.net:50000/BLUDB
Done.

[('E1001    ', datetime.date(2000, 8, 1), '100      ', '2        '),
 ('E1002    ', datetime.date(2001, 8, 1), '200      ', '5        '),
 ('E1003    ', datetime.date(2001, 8, 16), '300      ', '5        '),
 ('E1004    ', datetime.date(2000, 8, 16), '400      ', '5        '),
 ('E1005    ', datetime.date(2000, 5, 30), '500      ', '2        ')]

In [8]:
%sql select * from jobs limit 5;

 * ibm_db_sa://vcm60146:***@dashdb-txn-sbox-yp-dal09-04.services.dal.bluemix.net:50000/BLUDB
Done.

[('100      ', 'Sr. Architect', Decimal('60000.00'), Decimal('100000.00')),
 ('200      ', 'Sr. Software Developer', Decimal('60000.00'), Decimal('80000.00')),
 ('220      ', 'Sr. Designer', Decimal('70000.00'), Decimal('90000.00')),
 ('234      ', 'Sr. Designer', Decimal('70000.00'), Decimal('90000.00')),
 ('300      ', 'Jr.Software Developer', Decimal('40000.00'), Decimal('60000.00'))]

In [12]:
%sql select * from departments;

 * ibm_db_sa://vcm60146:***@dashdb-txn-sbox-yp-dal09-04.services.dal.bluemix.net:50000/BLUDB
Done.

[('2        ', 'Architect Group', '30001    ', 'L0001    '),
 ('5        ', 'Software Group', '30002    ', 'L0002    '),
 ('7        ', 'Design Team', '30003    ', 'L0003    ')]

In [11]:
%sql select * from locations;

 * ibm_db_sa://vcm60146:***@dashdb-txn-sbox-yp-dal09-04.services.dal.bluemix.net:50000/BLUDB
Done.

[('L0001    ', '2        '),
 ('L0002    ', '5        '),
 ('L0003    ', '7        ')]

### Query 1A: Select the names and job start dates of all employees who work for the department number 5.

In [36]:
%%sql 
select E.EMP_ID, E.F_NAME, E.L_NAME ,JH.START_DATE, E.DEP_ID
from  EMPLOYEES  E  left join  JOB_HISTORY JH
    on E.EMP_ID = JH.EMPL_ID 
where E.DEP_ID = 5;

 * ibm_db_sa://vcm60146:***@dashdb-txn-sbox-yp-dal09-04.services.dal.bluemix.net:50000/BLUDB
Done.

[('E1002    ', 'Alice', 'James', datetime.date(2001, 8, 1), '5        '),
 ('E1003    ', 'Steve', 'Wells', datetime.date(2001, 8, 16), '5        '),
 ('E1004    ', 'Santosh', 'Kumar', datetime.date(2000, 8, 16), '5        '),
 ('E1010    ', 'Ann', 'Jacob', datetime.date(2016, 8, 16), '5        ')]

### Query 1B: Select the names, job start dates, and job titles of all employees who work for the department number 5.

In [67]:
%%sql 
select E.EMP_ID, E.F_NAME, E.L_NAME ,H.START_DATE ,E.DEP_ID ,J.JOB_TITLE
from  EMPLOYEES  E  
    inner join  JOB_HISTORY H on E.EMP_ID = H.EMPL_ID
    inner join  JOBS J on H.JOBS_ID = J.JOB_IDENT
where E.DEP_ID = 5;

 * ibm_db_sa://vcm60146:***@dashdb-txn-sbox-yp-dal09-04.services.dal.bluemix.net:50000/BLUDB
Done.

[('E1002    ', 'Alice', 'James', datetime.date(2001, 8, 1), '5        ', 'Sr. Software Developer'),
 ('E1003    ', 'Steve', 'Wells', datetime.date(2001, 8, 16), '5        ', 'Jr.Software Developer'),
 ('E1004    ', 'Santosh', 'Kumar', datetime.date(2000, 8, 16), '5        ', 'Jr.Software Developer'),
 ('E1010    ', 'Ann', 'Jacob', datetime.date(2016, 8, 16), '5        ', 'Sr. Designer')]

### Query 2A: Perform a Left Outer Join on the EMPLOYEES and DEPARTMENT tables and select employee id, last name, department id and department name for all employees.

In [68]:
%%sql 
select E.EMP_ID, E.L_NAME ,E.DEP_ID, D.DEPT_ID_DEP, D.DEP_NAME, E.B_DATE
from EMPLOYEES E 
left join DEPARTMENTS D on E.DEP_ID = D.DEPT_ID_DEP

 * ibm_db_sa://vcm60146:***@dashdb-txn-sbox-yp-dal09-04.services.dal.bluemix.net:50000/BLUDB
Done.

[('E1001    ', 'Thomas', '2        ', '2        ', 'Architect Group', datetime.date(1976, 1, 9)),
 ('E1006    ', 'Allen', '2        ', '2        ', 'Architect Group', datetime.date(1978, 2, 6)),
 ('E1005    ', 'Hussain', '2        ', '2        ', 'Architect Group', datetime.date(1981, 1, 4)),
 ('E1002    ', 'James', '5        ', '5        ', 'Software Group', datetime.date(1972, 7, 31)),
 ('E1010    ', 'Jacob', '5        ', '5        ', 'Software Group', datetime.date(1982, 3, 30)),
 ('E1004    ', 'Kumar', '5        ', '5        ', 'Software Group', datetime.date(1985, 7, 20)),
 ('E1003    ', 'Wells', '5        ', '5        ', 'Software Group', datetime.date(1980, 8, 10)),
 ('E1007    ', 'Thomas', '7        ', '7        ', 'Design Team', datetime.date(1975, 5, 5)),
 ('E1009    ', 'Jones', '7        ', '7        ', 'Design Team', datetime.date(1990, 7, 9)),
 ('E1008    ', 'Gupta', '7        ', '7        ', 'Design Team', datetime.date(1985, 5, 6))]

### Query 2B: Re-write the query for 2A to limit the result set to include only the rows for employees born before 1980.

In [69]:
%%sql 
select E.EMP_ID, E.L_NAME ,E.DEP_ID, D.DEPT_ID_DEP, D.DEP_NAME, E.B_DATE
from EMPLOYEES E 
inner join DEPARTMENTS D on E.DEP_ID = D.DEPT_ID_DEP
where YEAR(E.B_DATE) < 1980;

 * ibm_db_sa://vcm60146:***@dashdb-txn-sbox-yp-dal09-04.services.dal.bluemix.net:50000/BLUDB
Done.

[('E1001    ', 'Thomas', '2        ', '2        ', 'Architect Group', datetime.date(1976, 1, 9)),
 ('E1002    ', 'James', '5        ', '5        ', 'Software Group', datetime.date(1972, 7, 31)),
 ('E1006    ', 'Allen', '2        ', '2        ', 'Architect Group', datetime.date(1978, 2, 6)),
 ('E1007    ', 'Thomas', '7        ', '7        ', 'Design Team', datetime.date(1975, 5, 5))]

### Query 2C: Re-write the query for 2A to have the result set include all the employees but department names for only the employees who were born before 1980

In [70]:
%%sql 
select E.EMP_ID, E.L_NAME ,E.DEP_ID, D.DEPT_ID_DEP, D.DEP_NAME,E.B_DATE
from EMPLOYEES E 
left join DEPARTMENTS D on E.DEP_ID = D.DEPT_ID_DEP and YEAR(E.B_DATE) < 1980;

 * ibm_db_sa://vcm60146:***@dashdb-txn-sbox-yp-dal09-04.services.dal.bluemix.net:50000/BLUDB
Done.

[('E1001    ', 'Thomas', '2        ', '2        ', 'Architect Group', datetime.date(1976, 1, 9)),
 ('E1002    ', 'James', '5        ', '5        ', 'Software Group', datetime.date(1972, 7, 31)),
 ('E1003    ', 'Wells', '5        ', None, None, datetime.date(1980, 8, 10)),
 ('E1004    ', 'Kumar', '5        ', None, None, datetime.date(1985, 7, 20)),
 ('E1005    ', 'Hussain', '2        ', None, None, datetime.date(1981, 1, 4)),
 ('E1006    ', 'Allen', '2        ', '2        ', 'Architect Group', datetime.date(1978, 2, 6)),
 ('E1007    ', 'Thomas', '7        ', '7        ', 'Design Team', datetime.date(1975, 5, 5)),
 ('E1008    ', 'Gupta', '7        ', None, None, datetime.date(1985, 5, 6)),
 ('E1009    ', 'Jones', '7        ', None, None, datetime.date(1990, 7, 9)),
 ('E1010    ', 'Jacob', '5        ', None, None, datetime.date(1982, 3, 30))]

### Query 3A: Perform a Full Join on the EMPLOYEES and DEPARTMENT tables and select the First name, Last name and Department name of all employees.

In [71]:
%%sql 
select E.EMP_ID, E.F_NAME ,E.L_NAME ,E.DEP_ID ,D.DEP_NAME 
from EMPLOYEES E 
full join DEPARTMENTS D on E.DEP_ID = D.DEPT_ID_DEP

 * ibm_db_sa://vcm60146:***@dashdb-txn-sbox-yp-dal09-04.services.dal.bluemix.net:50000/BLUDB
Done.

[('E1001    ', 'John', 'Thomas', '2        ', 'Architect Group'),
 ('E1002    ', 'Alice', 'James', '5        ', 'Software Group'),
 ('E1003    ', 'Steve', 'Wells', '5        ', 'Software Group'),
 ('E1004    ', 'Santosh', 'Kumar', '5        ', 'Software Group'),
 ('E1005    ', 'Ahmed', 'Hussain', '2        ', 'Architect Group'),
 ('E1006    ', 'Nancy', 'Allen', '2        ', 'Architect Group'),
 ('E1007    ', 'Mary', 'Thomas', '7        ', 'Design Team'),
 ('E1008    ', 'Bharath', 'Gupta', '7        ', 'Design Team'),
 ('E1009    ', 'Andrea', 'Jones', '7        ', 'Design Team'),
 ('E1010    ', 'Ann', 'Jacob', '5        ', 'Software Group')]

### Query 3B: Re-write Query 3A to have the result set include all employee names but department id and department names only for male employees.

In [72]:
%%sql 
select E.EMP_ID, E.F_NAME ,E.L_NAME ,E.DEP_ID ,D.DEP_NAME, E.SEX
from EMPLOYEES E 
full join DEPARTMENTS D on E.DEP_ID = D.DEPT_ID_DEP and E.SEX ='M';

 * ibm_db_sa://vcm60146:***@dashdb-txn-sbox-yp-dal09-04.services.dal.bluemix.net:50000/BLUDB
Done.

[('E1001    ', 'John', 'Thomas', '2        ', 'Architect Group', 'M'),
 ('E1003    ', 'Steve', 'Wells', '5        ', 'Software Group', 'M'),
 ('E1004    ', 'Santosh', 'Kumar', '5        ', 'Software Group', 'M'),
 ('E1005    ', 'Ahmed', 'Hussain', '2        ', 'Architect Group', 'M'),
 ('E1008    ', 'Bharath', 'Gupta', '7        ', 'Design Team', 'M'),
 ('E1002    ', 'Alice', 'James', '5        ', None, 'F'),
 ('E1006    ', 'Nancy', 'Allen', '2        ', None, 'F'),
 ('E1007    ', 'Mary', 'Thomas', '7        ', None, 'F'),
 ('E1009    ', 'Andrea', 'Jones', '7        ', None, 'F'),
 ('E1010    ', 'Ann', 'Jacob', '5        ', None, 'F')]